# GetPlaneOrigins Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents..::..GetPlaneOrigins Method
RoofComponents Class See Also
---
The plane origins of roof slabs.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<XYZ> GetPlaneOrigins()
```

Visual Basic
---
```text
Public Function GetPlaneOrigins As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetPlaneOrigins()
```

# ### Return Value
The origins.
# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace